In [2]:
import pandas as pd

data = pd.read_csv("D:/Dropbox/Work/Research/weboggle/2010/big data/weboggle_immc_small.csv")

In [3]:
data.head()

,num_id,time_stamp,zone,correct,guesses,score,session,commit_type,commit_limit,treat_dummy,_merge
0,60,18jun2011 05:33:15,420,14,19,14,9086,1.0,2.0,1,matched (3)
1,60,18jun2011 05:37:00,420,9,12,9,9086,1.0,2.0,1,matched (3)
2,80,09apr2008 21:18:45,300,8,8,8,9780,NaN,NaN,0,matched (3)
3,80,09apr2008 21:22:30,300,5,5,6,9780,NaN,NaN,0,matched (3)
4,80,09apr2008 21:26:15,300,20,20,22,9780,NaN,NaN,0,matched (3)

In [8]:
#OLS
import numpy as np
import statsmodels.formula.api as smf

Y = [1,3,4,5,2,3,4]
X = range(1,8)
data = pd.DataFrame({"Y":Y,"X":X})
model = smf.ols('Y~X',data=data)
results = model.fit()
print(results.summary())

                            OLS Regression Results
==============================================================================
Dep. Variable:                      Y   R-squared:                       0.161
Model:                            OLS   Adj. R-squared:                 -0.007
Method:                 Least Squares   F-statistic:                    0.9608
Date:                Mon, 21 Jan 2019   Prob (F-statistic):              0.372
Time:                        23:16:33   Log-Likelihood:                -10.854
No. Observations:                   7   AIC:                             25.71
Df Residuals:                       5   BIC:                             25.60
Df Model:                           1
Covariance Type:            nonrobust
==============================================================================
                 coef    std err          t      P>|t|      [0.025      0.975]
------------------------------------------------------------------------------
Intercept      2.1429      1.141      1.879      0.119      -0.789       5.075
X              0.2500      0.255      0.980      0.372      -0.406       0.906
==============================================================================
Omnibus:                          nan   Durbin-Watson:                   1.743
Prob(Omnibus):                    nan   Jarque-Bera (JB):                0.482
Skew:                           0.206   Prob(JB):                        0.786
Kurtosis:                       1.782   Cond. No.                         10.4
==============================================================================

Warnings:
[1] Standard Errors assume that the covariance matrix of the errors is correctly specified.

C:\Users\ticon\Anaconda3\lib\site-packages\statsmodels\stats\stattools.py:72: ValueWarning: omni_normtest is not valid with less than 8 observations; 7 samples were given.
  "samples were given." % int(n), ValueWarning)

In [9]:
data = pd.read_excel("D:\Dropbox\Work\Courses\CUHK\Workshops\Stata\Part I\company_record.xlsx")
data.head()

   id  hourly wage  experience  tenure
0   1         3.10           2       0
1   2         3.24          22       2
2   3         3.00           2       0
3   4         6.00          44      28
4   5         5.30           7       2

In [11]:
import statsmodels as sm

sm.stats.weightstats.ttest_ind(data["experience"],data["tenure"])

(1.4682594585600746, 0.15758634506374733, 20.0)

In [ ]:
df1 = df[df.Col2 == "A"].sample(1)
df2 = df[~df.index.isin(df1.index)]

df.loc[(df["B"] > 50) & (df["C"] == 900), "A"]
df.loc[(df["B"] > 50) & (df["C"] == 900), "A"].values